configuration/src/Catalogs/QuestionnaireTemplates/QuestionnaireTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>QuestionnaireTemplates</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Introduction</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ClosingStatement</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TemplateEditCompleted</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Enums/QuestionnaireTemplateQuestionTypes/QuestionnaireTemplateQuestionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>QuestionnaireTemplateQuestionTypes</name>
  <enumValues>
    <name>Basic</name>
  </enumValues>
  <enumValues>
    <name>QuestionWithCondition</name>
  </enumValues>
  <enumValues>
    <name>Tabular</name>
  </enumValues>
  <enumValues>
    <name>Complex</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/QuestionnaireTemplateQuestions/QuestionnaireTemplateQuestions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>QuestionnaireTemplateQuestions</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.QuestionnaireTemplates</owners>
  <attributes>
    <name>Wording</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsRequired</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>QuestionType</name>
    <type>
      <types>EnumRef.QuestionnaireTemplateQuestionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>TabularQuestionType</name>
    <type>
      <types>EnumRef.TabularQuestionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ElementaryQuestion</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
    </type>
  </attributes>
  <attributes>
    <name>ParentQuestion</name>
    <type>
      <types>CatalogRef.QuestionnaireTemplateQuestions</types>
    </type>
  </attributes>
  <attributes>
    <name>Notes</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolTip</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>HintPlacement</name>
    <type>
      <types>EnumRef.TooltipDisplayMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldUseRefusalToAnswer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RefusalToAnswerText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>TableQuestionComposition</name>
    <attributes>
      <name>ElementaryQuestion</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PredefinedAnswers</name>
    <attributes>
      <name>ElementaryQuestion</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
      </type>
    </attributes>
    <attributes>
      <name>Response</name>
      <type>
        <types>Characteristic.QuestionsForSurvey</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ComplexQuestionComposition</name>
    <attributes>
      <name>ElementaryQuestion</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.QuestionsForSurvey</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/QuestionnaireTemplates/Forms/ListForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure ListBeforeAddRow(Item, Cancel, Copy, Parent, Var_Group)
	
	If Copy
		And Not Var_Group Then
		
		CurrentData = Items.List.CurrentData;
		If CurrentData <> Undefined Then
			
			Cancel = True;
			NewItemRef = ExecuteItemCopying(CurrentData.Ref);
			If NewItemRef <> Undefined Then
				OpenForm("Catalog.QuestionnaireTemplates.ObjectForm", New Structure("Key", NewItemRef));
				Items.List.Refresh();
			EndIf;
			
		EndIf;
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Function ExecuteItemCopying(CopyingItem)
	
	BeginTransaction();
	Try
	
		QuestionnaireTemplateObject = Catalogs.QuestionnaireTemplates.CreateItem();
		
		FillPropertyValues(QuestionnaireTemplateObject,CopyingItem,"DeletionMark,Description,Title,Introduction,ClosingStatement");
		QuestionnaireTemplateObject.SetNewObjectRef(Catalogs.QuestionnaireTemplates.GetRef());
		QuestionnaireTemplateObject.TemplateEditCompleted = False;
		QuestionnaireTemplateObject.Write();
		
		Query = New Query;
		Query.Text = "
		|SELECT
		|	QuestionnaireTemplateQuestions.Ref AS Ref,
		|	QuestionnaireTemplateQuestions.DeletionMark,
		|	QuestionnaireTemplateQuestions.Predefined,
		|	QuestionnaireTemplateQuestions.Owner,
		|	QuestionnaireTemplateQuestions.Parent,
		|	QuestionnaireTemplateQuestions.IsFolder,
		|	QuestionnaireTemplateQuestions.Code AS Code,
		|	QuestionnaireTemplateQuestions.Description,
		|	QuestionnaireTemplateQuestions.IsRequired,
		|	QuestionnaireTemplateQuestions.QuestionType,
		|	QuestionnaireTemplateQuestions.TabularQuestionType,
		|	QuestionnaireTemplateQuestions.ElementaryQuestion,
		|	QuestionnaireTemplateQuestions.ParentQuestion,
		|	QuestionnaireTemplateQuestions.ToolTip AS ToolTip,
		|	QuestionnaireTemplateQuestions.HintPlacement AS HintPlacement,
		|	QuestionnaireTemplateQuestions.TableQuestionComposition.(
		|		ElementaryQuestion AS ElementaryQuestion,
		|		LineNumber
		|	),
		|	QuestionnaireTemplateQuestions.PredefinedAnswers.(
		|		ElementaryQuestion AS ElementaryQuestion,
		|		Response,
		|		LineNumber
		|	),
		|	QuestionnaireTemplateQuestions.ComplexQuestionComposition.(
		|		ElementaryQuestion AS ElementaryQuestion,
		|		LineNumber
		|	),
		|	QuestionnaireTemplateQuestions.Wording
		|FROM
		|	Catalog.QuestionnaireTemplateQuestions AS QuestionnaireTemplateQuestions
		|WHERE
		|	QuestionnaireTemplateQuestions.Owner = &QuestionnaireTemplate
		|
		|ORDER BY
		|	Ref HIERARCHY,
		|	Code";
		
		Query.SetParameter("QuestionnaireTemplate", CopyingItem);
		
		Result = Query.Execute();
		
		Selection = Result.Select(QueryResultIteration.ByGroupsWithHierarchy);
		AddQuestionnaireTemplateQuestionsCatalogItems(QuestionnaireTemplateObject.Ref, Selection);
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		Return Undefined;
		
	EndTry;
	
	Return QuestionnaireTemplateObject.Ref;
	
EndFunction

&AtServer
Procedure AddQuestionnaireTemplateQuestionsCatalogItems(Ref, Selection, Parent = Undefined)
	
	QuestionsWithCondition = New Map;
	
	While Selection.Next() Do
		
		If Selection.IsFolder Then
			
			NewItem = Catalogs.QuestionnaireTemplateQuestions.CreateFolder();
			FillPropertyValues(NewItem,Selection,"Description,Code,Wording");
			
		Else
			
			NewItem = Catalogs.QuestionnaireTemplateQuestions.CreateItem();
			
			RefToNew = Catalogs.QuestionnaireTemplateQuestions.GetRef();
			NewItem.SetNewObjectRef(RefToNew);
			
			FillPropertyValues(NewItem,Selection,,"Owner,Parent,TableQuestionComposition,PredefinedAnswers,ComplexQuestionComposition,Code,ParentQuestion");
			TableQuestionComposition = Selection.TableQuestionComposition.Unload();
			TableQuestionComposition.Sort("LineNumber Asc");
			NewItem.TableQuestionComposition.Load(TableQuestionComposition);
			PredefinedAnswers = Selection.PredefinedAnswers.Unload();
			PredefinedAnswers.Sort("LineNumber Asc");
			NewItem.PredefinedAnswers.Load(PredefinedAnswers);
			ComplexQuestionComposition = Selection.ComplexQuestionComposition.Unload();
			ComplexQuestionComposition.Sort("LineNumber Asc");
			NewItem.ComplexQuestionComposition.Load(ComplexQuestionComposition);
			
			If Selection.QuestionType = Enums.QuestionnaireTemplateQuestionTypes.QuestionWithCondition Then
				QuestionsWithCondition.Insert(Selection.Ref,RefToNew);
			EndIf;
			
			If Not Selection.ParentQuestion.IsEmpty() Then
				NewItem.ParentQuestion = QuestionsWithCondition.Get(Selection.ParentQuestion);
			EndIf;
			
		EndIf;
		
		NewItem.Owner = Ref;
		NewItem.Parent = ?(Parent = Undefined,Catalogs.QuestionnaireTemplateQuestions.EmptyRef(),Parent);
		NewItem.Write();
		
		SubordinateSelection = Selection.Select(QueryResultIteration.ByGroupsWithHierarchy);
		If SubordinateSelection.Count() > 0 Then
			AddQuestionnaireTemplateQuestionsCatalogItems(Ref,SubordinateSelection,NewItem.Ref);
		EndIf;
		
	EndDo;
	
EndProcedure

#EndRegion
